<template>
    <div>
        <b-modal v-model="dialog" hide-header size="lg" hide-footer style="border-radius: 24px !important">
            <div>
                <div class="oferta-card" style="padding-left: 20px; padding-right: 20px">
                    <div class="d-flex justify-content-between py-4">
                        <h4>{{ $t('oferta') }}</h4>
                        <b-button variant="light" size="sm" class="border-0" @click="dialog = false">
                            <svg width="24" height="25" viewBox="0 0 24 25" fill="none" xmlns="http://www.w3.org/2000/svg">
                                <path
                                    fill-rule="evenodd"
                                    clip-rule="evenodd"
                                    d="M5.29289 5.79289C5.68342 5.40237 6.31658 5.40237 6.70711 5.79289L12 11.0858L17.2929 5.79289C17.6834 5.40237 18.3166 5.40237 18.7071 5.79289C19.0976 6.18342 19.0976 6.81658 18.7071 7.20711L13.4142 12.5L18.7071 17.7929C19.0976 18.1834 19.0976 18.8166 18.7071 19.2071C18.3166 19.5976 17.6834 19.5976 17.2929 19.2071L12 13.9142L6.70711 19.2071C6.31658 19.5976 5.68342 19.5976 5.29289 19.2071C4.90237 18.8166 4.90237 18.1834 5.29289 17.7929L10.5858 12.5L5.29289 7.20711C4.90237 6.81658 4.90237 6.18342 5.29289 5.79289Z"
                                    fill="#6A6D7D"
                                />
                            </svg>
                        </b-button>
                    </div>
                    <hr class="m-0" />

                    <div style="height: 80vh; overflow-y: auto" class="mb-2">
                        <p>
                            Мазкур ҳужжат ҳужжат Ўзбекистон Савдо саноат палатасининг “САВДО САНОАТ ПАЛАТАСИ ЯГОНА АХБОРОТ ТИЗИМИ” ахборот тизимидан (кейинги ўринларда - Тизим)
                            тадбиркорларнинг рўйхатдан ўтиши, шахсий кабинет очиши ва ундан фойдаланиш бўйича Ўзбекистон Республикаси Фуқаролик кодексининг 367-моддаси ва
                            369-моддаси иккинчи қисмига мувофиқ хизмат кўрсатиш шартномасини (кейинги ўринларда – Шартнома) тузиш юзасидан лаёқатли бўлган тадбиркорларга (кейинги
                            ўринларда – Фойдаланувчи) расмий таклиф ҳисобланади. <br />
                            Фойдаланувчи томонидан мазкур офертада белгиланган ҳаракатларнинг бажарилиши, у томонидан қуйидаги шартлар сўзсиз қабул қилинганлигини англатади
                            (Офертанинг акцепти). Офертани акцепт қилган пайтдан шартнома тузилган ҳисобланади. Мазкур шартномада тўғридан-тўғри назарда тутилмаган барча ҳолларда,
                            томонлар Ўзбекистон Республикаси қонун ҳужжатлари ва иш муомаласи одатларига риоя қиладилар.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">1. АТАМА ВА ТАЪРИФЛАР.</p>
                        <p class="mt-0 pt-0">
                            1.1. Мазкур шартномада қуйидаги атама ва таърифлар қўлланилади:
                            <br /><span style="font-weight: bold">Шахсга доир маълумотларни қайта ишлаш</span> – шахсга доир маълумотларни йиғиш, тизимлаштириш, сақлаш, ўзгартириш,
                            тўлдириш, улардан фойдаланиш, уларни бериш, тарқатиш, узатиш, эгасизлантириш ва йўқ қилиш бўйича битта ёки бир нечта ҳаракатларни амалга ошириш;
                            <br /><span style="font-weight: bold">Шахсга доир маълумотлар</span>
                            – Тизимдан фойдаланиш учун фойдаланувчи томонидан тақдим этилган муайян жисмоний ва юридик шахсларга тааллуқли бўлган ёки уни идентификация қилиш
                            имконини берадиган барча турдаги (шу жумладан солиқ, божхона, давлат активлари, кадастр ва банк сирлари билан боғлик ҳамда қонун ҳимоя қилинадиган бошқа
                            маълумотлар) ахборотлар;
                            <br /><span style="font-weight: bold"> Хизмат кўрсатувчи Хизмат кўрсатувчи</span>- фойдаланувчига
                            <span style="font-weight: bold"> “my.chamber.uz”</span>манзили орқали тадбиркорлик субъектлари фаолияти бўйича ваколатли органлар томонидан
                            ўтказиладиган текширишлар тўғрисидаги ҳамда уларнинг ҳуқуқ ва манфаатларини ҳимоя қилиш билан боғлиқ маълумотларни жойлаштириб борувчи ташкилот;
                            <br /><span style="font-weight: bold">Фойдаланувчи</span>
                            – мазкур оферта шартларини қабул қилган ва
                            <span style="font-weight: bold"> “my.chamber.uz”</span>сайти орақали хизматларни олувчи лаёқатли жисмоний шахс.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">2. АКЦЕПТ ТАРТИБИ</p>
                        <p class="mt-0 pt-0">
                            2.1. Мазкур Офертанинг акцепти
                            <span style="font-weight: bold"> “my.chamber.uz”</span>сайти орқали авторизациядан ўтиб, хизмат кўратувчи томонидан кўрсатиладиган хизматларни олиш
                            орқали амалга оширилади. <br />
                            2.2. Мазкур Шартномани тузиш орқали фойдаланувчи хизмат курсатувчига амалдаги шахсга доир маълумотлар тўғрисидаги қонун ҳужжатлари талабларига мувофиқ,
                            ушбу шартномани бажариш мақсадида, автоматизация воситаларидан фойдаланган ёки улардан фойдаланмаган ҳолда, ўзининг шахсга доир маълумотларига (шу
                            жумладан,божхона, давлат активлари, кадастр ва банк сирлари ҳамда қонун ҳимоя қилинадиган бошқа билан боғлик маълумотлар ҳамда мобиль телефон рақами,
                            Ф.И.Ш., рўйхатдан ўтиш билан боғлиқ маълумотлар, шунингдек, бошқа шахсга доир маълумотлар) ишлов беришга муддатсиз розилигини беради.
                            <br />Шунингдек, ушбу орқали фойдаланувчи мазкур шартнома бўйича хизмат кўрсатувчига тақдим этилган шахсга доир маълумотларни ушбу шартномани бажариш
                            мақсадида учинчи шахсларга тақдим этишга ва улардан олишга розилик беради. <br />2.3. Хизмат кўрсатувчи Фойдаланувчининг шахсга доир маълумотларнинг
                            махфийлиги бўйича Ўзбекистон Республикасининг амалдаги қонун ҳужжатлари талабларига мувофиқ барча зарур бўлган чораларни кўришини Фойдаланувчига
                            кафолатлайди. Фойдаланувчи унинг шахсга доир маълумотларига ишлов беришга розилиги (шу жумладан учинчи шахсларга ҳам) муддатсиз ҳисобланиб, истаган
                            пайтда шахсга доир маълумотларига ишлов беришга розилигини қайтариб олиши мумкин. <br />2.4. Тизимдан фойдаланишдан аввал Фойдаланувчи мазкур Офертанинг
                            матни билан тўлиқ танишиб чиқиши зарур. Фойдаланувчи Офертанинг шартларидан тўлиқ ёки қисман норози бўлса, Тизимдан фойдаланишдан бош тортиши зарур.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">3. ШАРТНОМА ПРЕДМЕТИ</p>
                        <p class="mt-0 pt-0">
                            3.1. Фойдаланувчи хизмат кўрсатувчининг
                            <span style="font-weight: bold"> “my.chamber.uz”</span>манзилида руйхатдан ўтади. Руйхатдан ўтиш жараёнида шахсий маълумотлар, тадбиркорлик субъектнинг
                            юридик манзили ва бошқа реквизитлари тўлдирилади. Фойдаланувчи Рўйхатдан ўтиш ва тизимдан фойдаланиш пайтида берилган маълумотларнинг аниқ, тўғри ва
                            долзарб эканлигига ва ушбу маълумотлардан фойдаланиш ҳуқуқига эга эканлигига кафолат беради. Фойдаланувчи маълумотлари ўзгарса, уларни янгилаш
                            мажбуриятини олади. <br />3.2. Рўйхатдан ўтгандан кейин тадбиркорга шахсий кабинет очилади. Шахсий кабинетда ўз фаолиятида рўйхатга олинган текширишлар
                            тўғрисида маълумотлар ҳамда давлат назорат функциялари, мажбурий талаблар ва текшириш ҳуқуқи эга бўлган мансабдор шахслар реестрлари мавжуд бўлади.
                            Фойдаланувчи тизим орқали ушбу маълумотлар ва реестрлардан фойдаланиши ҳамда тизимдан рўйхатдан ўтиш ва фойдаланиш жараёнида тизим орқали смс
                            хабарномалар олиши мумкин. <br />Шунингдек, шахсий кабинет орқали Фойдаланувчи ўз фаолиятида ўтказилаётган текширувларни Текширувларни рўйхатга олиш
                            китобида рўйхатга олиши, текширув жараёни юзасидан ариза ва шикоят қолдириши, ўз фикрларини йўллай олиши мумкин. <br />Шунингдек тизимда видео-дарслар
                            ва қўлланмалар жойлаштирилади. Тизим орқали унга жойлаштирилган ресурслардан фойдаланиш бепул. <br />Тизимдан фойдаланиш жаранида Фойдаланувчига
                            йўлланадиган смс хабарномалар учун Фойдаланувчининг мобил алоқа ҳисоб рақамидан мобил алоқа операторлари ва контент-провайдерлар томонидан белгиланган
                            нархларга асосан қўшимча тўловлар ечиб олиниши мумкин.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">4. ТАРАФЛАР МАЖБУРИЯТЛАРИ</p>
                        <p class="mt-0 pt-0">
                            4.1. Хизмат кўрсатувчи қуйидагиларга мажбур: <br />
                            <span style="font-weight: bold"> “my.chamber.uz”</span>
                            тизимининг узлуксиз ишини таъминлаш (учинчи шахсларнинг айби билан юзага келадиган узилиш ҳолатлари бундан мустасно), шахсга доир маълумотларнинг
                            махфийлигига риоя қилиш,(мазкур шартноманинг 2.2. бандида кўрсатилган ҳоллар бундан мустасно), уларга ноқонуний ишлов беришнинг олдини олиш, уларнинг
                            яхлитлиги ва сақланишини таъминлайдиган ҳуқуқий, ташкилий ва техник чораларни кўриш.
                            <br />4.2. Фойдаланувчи қуйидагиларга мажбур: <br />мазкур офертанинг талабларини бажариш, Тизимга уланувчи воситанинг ахборот хавфсизлигини мустақил
                            равишда таъминлаш; ўзининг лаёқатлиги, шунингдек Тизимдан фирибгарлик ва бошқа ғайриқонуний мақсадларда фойдаланмаслигини тасдиқлаш ва кафолатлаш,
                            Хизмат кўрсатувчининг розилигини олдиндан олмасдан шартнома бўйича ҳуқуқ ва мажбуриятларини учинчи шахсларга бермаслик. <br />4.3. Хизмат кўрсатувчи бир
                            томонлама мазкур Офертага ўзгартириш киритишга ҳақли, бунда Хизмат кўрсатувчи Фойдаланувчини бу ҳақда Тизим ёки СМС-хабар орқали огоҳлантиради.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">5. ТОМОНЛАРНИНГ ЖАВОБГАРЛИГИ</p>
                        <p class="mt-0 pt-0">
                            5.1. Томонлар мазкур шартноманинг талабларини бажармаганлиги ёки лозим даражада бажармаганлиги учун Ўзбекистон Республикаси қонунчилигига мувофиқ жавоб
                            берадилар. <br />
                            5.2. Фойдаланувчи мазкур шартнома бўйича ўз мажбуриятларини бажармаганлиги ёки лозим даражада бажармаганлиги натижасида вужудга келган ҳар қандай зарар
                            ёки салбий оқибатларга ўзи жавоб беради.
                            <br />
                            5.3. Фойдаланувчи хавфсиз бўлмаган уланишлардан фойдаланган ҳолда, ёхуд зарарли дастур ва иловалар таҳдиди остида ўзининг шахсга доир маълумотларини
                            қурилмага киритишида уларнинг хавфсизлигига тўлиқ жавоб беради. <br />
                            5.4. Фойдаланувчи томонидан шартнома шартлари бажарилмаганлиги ёки лозим даражада бажарилмаганлиги оқибатида Хизмат кўрсатувчи шартномада белгиланган
                            мажбуриятларни бажара олмаганлиги учун Хизмат кўрсатувчи жавобгар бўлмайди.
                            <br />5.5. Фойдаланувчи шартнома шартлари билан ўз вақтида ёки буткул танишмаганлиги оқибатида вужудга келадиган зарар учун Хизмат кўрсатувчи жавобгар
                            бўлмайди. <br />5.6. Хизмат кўрсатувчининг назорат доирасига кирмайдиган сабабларга кўра шартнома шартлари лозим даражада бажарилмаслигига Хизмат
                            кўрсатувчи жавобгар бўлмайди. <br />Хизмат кўрсатувчининг назорат доираси фақат ушбу Тизим хизматларининг ишлаши билан чекланиб, учинчи шахсларнинг айби
                            билан вужудга келган узилишларга ёхуд давлат органлари ёки суд томонидан қуйилган чеклов ва тақиқларни ўз ичига олмайди. <br />5.7. Ҳар бир Томон ушбу
                            шартномада белгиланган жавобгарлик чекланганлигини тан олган ҳолда, бошқа Томон мазкур шартномани тузишни ва ушбу чекловлар тарафлар ўртасидаги
                            келишувлар учун зарур асос эканлигини тан олади. Бунда, томонларнинг назоратидан ташқаридаги ҳар қандай шароитлар оқибатида, шу жумладан, ҳуқумат
                            фаолияти ёки террористик ҳаракатлар, зилзилалар, ёнғинлар, тошқинлар ёки бошқа табиий офатлар, иш шароитлари билан боғлиқ вазиятлар, электр
                            таъминотидаги узилишлар ва Интернетга уланишидаги бузилишлар, бу билан чегараланмаган ҳолда, шунга ўхшаш ҳолатларда томонларнинг ҳеч бири шартнома
                            талабларини бажармаганлиги ёки бажаришни кечиктирганлиги учун жавоб бермайди.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">6. ШАРТНОМАНИ БЕКОР ҚИЛИШ</p>
                        <p class="mt-0 pt-0">
                            6.1. Фойдаланувчи Тизимдаги ўз
                            <span style="font-weight: bold">аккаунтини ўчириб, шахсий кабинетдан чиқиб кетган ҳолда</span>
                            мазкур шартномани ҳар қандай вақтда бажармасликка ҳақли.
                            <br />6.2. Мазкур шартнома аккаунт ўчирилган вақтдан бошлаб бекор қилинган деб ҳисобланади.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">7. КЕЛИШМОВЧИЛИКЛАРНИ КЎРИБ ЧИҚИШ ТАРТИБИ</p>
                        <p class="mt-0 pt-0">
                            7.1. Мазкур шартномадан келиб чиқувчи ҳар қандай низо, ўзаро музокаралар орқали, ёхуд Фойдаланувчининг ёзма мурожаати асосида шикоят тартибида кўриб
                            чиқилиши зарур. Мурожаатни кўриб чиқиш ва ва унинг мазмунига қуйиладиган талаблар амалдаги Ўзбекистон Республикаси қонунчилиги билан белгиланади. <br />
                            7.2. Агар вужудга келган низо музокаралар ёки шикоят тартибида ҳал этилмаса, низо Ўзбекистон Республикасининг амалдаги қонунчилиги билан белгиланган
                            тартибда жавобгар жойлашган жойдаги тааллуқлилиги бўйича тегишли судда кўриб чиқилиши керак. <br />
                            7.3. Фойдаланувчилар шикоятлари билан боғлиқ ишлар ва техник кўллаб-қувватлаш хизматлари Фойдаланувчиларга фақат сўровларни қабул қилиш, уларга ишлов
                            бериш ва тегишли сўровларга жавобларни юбориш орқали амалга оширилади.
                        </p>
                        <p class="text-center mb-0 pb-0" style="font-weight: bold">8. БОШҚА ШАРТЛАР</p>
                        <p class="mt-0 pt-0">
                            8.1. Тўғридан-тўғри шартномада назарда тутилмаган ҳолатлар Ўзбекистон Республикасининг амалдаги қонунчилигида белгиланган тартибда амалга оширилади.
                            <br />
                            8.2. Ушбу таклифни қабул қилиб, Фойдаланувчи ушбу шартноманинг барча шартларини сўзсиз қабул қилганлигини тасдиқлайди ва уни бажаришни ўз зиммасига
                            олади.
                        </p>
                    </div>
                </div>
                <hr class="m-0" />
                <b-row class="m-2 mt-4" v-if="ofertaModalClose">
                    <b-col>
                        <b-form-checkbox v-model="isCheck">
                            {{ $t('Оферта шартларига розиман') }}
                        </b-form-checkbox>
                    </b-col>
                    <b-col class="text-right">
                        <b-button :disabled="!isCheck" @click="signOferta" variant="success" class="ml-4">
                            {{ $t('sign') }}
                        </b-button>
                    </b-col>
                </b-row>
                <b-row class="m-2 mt-4" v-if="!ofertaModalClose">
                    <b-col class="text-right">
                        <b-button @click="signOfertaClose" variant="success" class="ml-4">
                            {{ $t('close') }}
                        </b-button>
                    </b-col>
                </b-row>
            </div>
        </b-modal>
        <b-modal hide-footer v-model="imzoOpenModal">
            <JustSign @sign="loginESP($event)"></JustSign>
        </b-modal>
    </div>
</template>

<script>
import JustSign from './justSign.vue';
import AccountService from '@/services/account.service';
export default {
    props: {
        value: {
            type: Boolean,
            default: false
        }
    },
    components: {
        JustSign
    },
    created() {
        if (JSON.parse(localStorage.getItem('user_info'))?.contractor?.isLastOffer) {
            this.ofertaModalClose = false;
        }
    },
    computed: {
        getUserName() {
            return localStorage.getItem('user_info') ? JSON.parse(localStorage.getItem('user_info'))?.contractor?.fullName : '';
        },
        dialog: {
            get() {
                return this.value;
            },
            set(val) {
                this.$emit('input', val);
            }
        }
    },
    data() {
        return {
            GetInfoData: {},
            isCheck: false,
            ofertaModalClose: true,
            imzoOpenModal: false,
            lang: localStorage.getItem('locale') || 'uz_latn'
        };
    },
    methods: {
        signOferta() {
            this.imzoOpenModal = true;
        },
        signOfertaClose() {
            this.$emit('closeOferta', false);
        },
        loginESP(data) {
            var info = {};
            if (!!data.data.alias) {
                var arr = [];
                data.data.alias.split(',').forEach(function (item) {
                    arr.push(item.split('='));
                });
                const entries = new Map(arr);
                info = Object.fromEntries(entries);
            }
            var obj = {
                signedData: data.key,

                isPinfl: info['1.2.860.3.16.1.1'] ? false : true
            };
            this.signModal = false;
            AccountService.IsOffer(obj)
                .then((res) => {
                    try {
                        let data = JSON.parse(localStorage.getItem('user_info'));
                        data.contractor.isLastOffer = true;
                        localStorage.setItem('user_info', JSON.stringify(data));
                        this.$emit('offerModal', false);
                        this.imzoOpenModal = false;
                        this.$router.push({ name: 'MyCabinet' });
                    } catch (e) {}
                })
                .catch((error) => {
                    this.makeToast(error.response.data, 'error');
                });
        }
    }
};
</script>

<style lang="scss" scoped>
.modal-text-style {
    padding: 10px;
    margin: 10px;
    font-size: 18px;
}
.create-text-success {
    background-color: #27ae60;
    border-radius: 50px;
    width: 40%;
    color: #fff;
    font-family: Montserrat;
    font-size: 16px;
    font-style: normal;
    font-weight: 500;
    line-height: normal;
}
.create-text-danger {
    background-color: #c75353;
    border-radius: 50px;
    width: 40%;
    color: #fff;
    font-family: Montserrat;
    font-size: 16px;
    font-style: normal;
    font-weight: 500;
    line-height: normal;
}
</style>
