<template>
    <b-card no-body>    
      <b-row class="m-2">
        <b-col sm="12" md="12" lg="12" class="text-center mb-2">
            <h3>{{ $t('«Ҳамкор тадбиркор» ахборот тизими билан маълумотлар базалари интеграция қилинадиган вазирлик ва идоралар') }}</h3>
        </b-col >
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('1. Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги') }}</p>
        </b-col >
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('2. Ўзбекистон Республикаси Адлия вазирлиги') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('3. Ўзбекистон Республикаси Камбағалликни қисқартириш ва бандлик вазирлиги') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('4. Ўзбекистон Республикаси Марказий банки ва тижорат банклари') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('5. Ўзбекистон Республикаси Давлат активларини бошқариш агентлиги') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('6. Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги ҳузуридаги Солиқ қўмитаси') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('7. Ўзбекистон Республикаси Иқтисодиёт ва молия вазирлиги ҳузуридаги Божхона қўмитаси') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('8. Ўзбекистон Республикаси Камбағалликни қисқартириш ва бандлик вазирлиги ҳузуридаги Маҳаллабай ишлаш ва тадбиркорликни ривожлантириш агентлиги') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('9. Тадбиркорлик фаолиятини қўллаб-қувватлаш давлат жамғармаси') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('10. Ўзбекистон Республикаси Инвестициялар, саноат ва савдо вазирлиги') }}</p>
        </b-col>
        <b-col sm="12" md="12" lg="12">
            <p>{{ $t('11. Ўзбекистон Республикаси Президенти ҳузуридаги статистика агентлиги') }}</p>
        </b-col>
      </b-row>
    </b-card>
  </template>
  
  <script>
  import {
    BButton,
    BTable,
    BCol,
    BRow,
    BCard,
    BBadge,
    BCardText
  } from "bootstrap-vue";
  
  export default {
    components: {
      BButton,
      BTable,
      BCol,
      BRow,
      BCard,
      BBadge,
      BCardText
    },
   
    data() {
      return {
      }
    },
    computed: {
    
    },
    created() {
    },
    methods: {
    
    }
  };
  </script>
  
  <style lang="scss" scoped>
  </style>
  