<script setup lang="ts"></script>

<template>
	<main class="container py-5">
		<section>
			<div class="mb-2">
				<h1 class="text-uppercase">ПОЛИТИКА КОНФИДЕНЦИАЛЬНОСТИ ПЕРСОНАЛЬНОЙ ИНФОРМАЦИИ «ТОРГОВО-ПРОМЫШЛЕННОЙ ПАЛАТЫ РЕСПУБЛИКИ УЗБЕКИСТАН»</h1>
			</div>
		</section>

		<section>
			<p>
				Настоящая Политика конфиденциальности персональной информации (далее — Политика) действует в отношении информации, которую
				Торгово-промышленной палаты Республики Узбекистан, (далее ТПП) может получить о Пользователе во время использования сервиса ТПП в виде
				мобильного или веб-приложения, а также любых других программ, продуктов, услуг Торгово-промышленной палаты Республики Узбекистан (далее —
				Сервисы ТПП). Политика применима только к Сервисам ТПП не контролирует и не несет ответственность за сайты /сервисы третьих лиц, на которые
				Пользователь может перейти по ссылкам, доступным из Сервисов ТПП, в том числе за обрабатываемую третьими лицами информацию о Пользователе. Все
				не приведённые и используемые по тексту Политики термины и определения приведены в иных соглашениях\договорах, предметом которых является
				порядок предоставления и использования Пользователем Сервисов ТПП.
			</p>

			<p>
				<b>
					Использование Сервисов ТПП означает безоговорочное согласие Пользователя с настоящей Политикой и указанными в ней условиями обработки его
					персональной информации; в случае несогласия с этими условиями Пользователь должен воздержаться от использования Сервисов ТПП.
				</b>
			</p>

			<section>
				<h4>1. Информация Членов , которую получает и обрабатывает ТПП:</h4>
				<p>
					<b>1.1.</b>В рамках настоящей Политики под персональной информацией Пользователя понимаются:
					<br />
					<b>1.1.1.</b>Персональная информация, которую Пользователь предоставляет о себе самостоятельно при регистрации в любом из Сервисов ТПП или в
					процессе использования Сервисов ТПП, включая персональные данные Пользователя, передаваемые в ходе исполнения любых соглашений ТПП с
					Пользователем. Следует учесть, что использование Пользователем определенных сервисов ТПП возможно только в случае предоставления необходимых
					данных.
					<br />
					<b>1.1.2.</b>Данные, которые автоматически передаются ТПП в процессе использования Сервисов ТПП с помощью установленного на устройстве
					Пользователя программного обеспечения, в том числе IP-адрес, информация из cookie (текстовые файлы, хранящиеся в браузере Пользователя),
					информация о браузере Пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам ТПП), время доступа, адрес
					запрашиваемой страницы.
					<br />
					<b>1.1.2.1.</b>При использовании Сервисов ТПП, происходит автоматический сбор (из cookies) следующих обезличенных статистических данных о
					Пользователе, в том числе:
				</p>
				<ul>
					<li>тип выполненного на сайте действия (клик, наведение курсора и т.п.);</li>
					<li>дата и время выполнения действия;</li>
					<li>URL страницы;</li>
					<li>Referer;</li>
					<li>IP (без возможности работы с IP-адресами в статистике);</li>
					<li>User-Agent;</li>
					<li>ClientID (идентификатор браузера по файлу cookie);</li>
					<li>экранное разрешение;</li>
					<li>класс HTML-элемента, на который происходит клик;</li>
					<li>поисковые запросы</li>
					<li>все детали по платежам, включаемым и выключаемым функциям;</li>
					<li>геопозицию Пользователя;</li>
					<li>отчёты об ошибках с детальной информацией об устройствах, модели, производителя и др;</li>
					<li>данные о телефонных контактах Пользователя;</li>
					<li>
						данные об информации просматриваемой Пользователем в интерфейсе Сервисов ТПП, включая информацию в разделах: «Партнер-предприниматель»;
						«Членство»; «Исковое заявление»; «Услуги»; «Двойное образование»; «Третейский суд»; «Бухгалтерский учет»; «Коррупция»; «Учет кадров»;
						«Настройки», а также любые другие разделы, добавляемые в будущем;
					</li>
					<li>данные о фактах заполнения форм/обращений на сайте и\или в мобильном приложении ТПП, включая ошибки при их заполнении.</li>
				</ul>
				<br />
				<b>1.1.2.2.</b>Пользуясь любым сервисом, предоставляемым ТПП Пользователь соглашается на то, что ТПП может использовать статистические данные
				и файлы сookies, для их последующей обработки системами, и может передавать третьему лицу для проведения исследований, выполнения работ или
				оказания услуг ТПП. Пользователь может самостоятельно управлять файлами Cookies путем изменения настроек браузера, функционирующего на его
				оборудовании. Изменения пользовательских настроек, в результате которых файлы cookies будут заблокированы, могут привести к недоступности
				отдельных компонентов ТПП.
				<br />
				<b>1.1.3.</b>ТПП может получить общедоступную информацию, когда Пользователь использует сторонние ресурсы (например, чаты/форму/социальные
				сети). Эти данные могут содержать информацию, которую Пользователь публикует, в том числе в виде комментариев или отзывов о Сервисах ТПП. ТПП
				использует такие сведения в целях повышения качества обслуживания Членов .
				<br />
				<b>1.1.4.</b>ТПП также может обрабатывать определенные данные (например, IP-адрес, идентификатор пользовательского устройства) для выявления и
				(или) предотвращения условий, способствующих совершению с использованием Сервиса ТПП действий, противоречащих требованиям законодательства и
				настоящей Политики.
				<br />
				<b>1.1.4.</b>ТПП может получать информацию о Пользователе от своих контрагентов и \или Партнеров. Например, при исполнении соглашения с
				контрагентом, последний может передавать ТПП некоторые сведения, которые обеспечивают контрагенту возможность установления связи между таким
				Пользователем и его переводом, информация о совершении которого передается ТПП контрагенту
				<br />
				<b>1.1.6.</b> ТПП может получать информацию в целях поддержания должного уровня безопасности онлайн сервисов, совершаемых Пользователем с
				использованием информационнқх систем. Перечень таких сведений определен в п. 3.3.2.1. Политики.
				<p></p>
				<h4>2. Цели сбора и обработки персональной информации Клиентов</h4>
				<p>
					<b>2.1.</b> ТПП собирает и хранит только ту персональную информацию, которая необходима для предоставления Сервисов ТПП или исполнения
					соглашений с Пользователем, за исключением случаев, когда законодательством предусмотрено обязательное получение и хранение определенной
					персональной информации. Хранение персональной информации осуществляется не дольше, чем этого требуют цели обработки, если только срок
					хранения такой персональной информации не установлен законодательством РУз, Политикой об использовании Пользователем Сервисов ТПП.
					<br />
					<b>2.2.</b>Персональную информацию Пользователя ТПП может использовать в следующих целях:
					<br />
					<b>2.2.1.</b>Исполнения соглашений с ТПП, а также соглашений, заключаемых с контрагентами ТПП в том числе в целях проведения
					идентификации/упрощенной идентификации Пользователя, предоставления Пользователю возможностей использования всех доступных сервисов ТПП;
					<br />
					<b>2.2.2.</b>Коммуникаций. Осуществление связи с Пользователем, в том числе направления уведомлений, запросов и информации, касающихся
					использования Сервисов ТПП / оказания ТПП услуг, а также обработки запросов и заявок от Пользователя, в том числе с последующей передачей
					таких запросов и заявок на исполнение контрагентам ТПП;
					<br />
					<b>2.2.3.</b> Улучшения качества Сервисов ТПП, удобства их использования, разработки новых Сервисов ТПП, предложения Пользователю
					персонализированных Сервисов ТПП;
					<br />
					<b>2.2.4.</b> Проведения статистических и иных исследований на основе обезличенных данных;
					<br />
					<b>2.2.5.</b> Проведения маркетинговых акций для Членов , в том числе в целях распространения предложений об участии в акциях инициируемых
					ТПП совестно с Партнерами\контрагентами и получения предусмотренных акцией призов/вознаграждений; распространения рекламно-информационных
					материалов по сетям электросвязи, в том числе посредством использования телефонной, факсимильной, подвижной радиотелефонной связи, или путем
					прямых контактов; таргетирования рекламных материалов и иной информации, доводимой до сведения Членов .
					<br />
					<b>2.2.6.</b>Предотвращение условий, способствующих совершению с использованием Информационного сервиса ТПП действий, противоречащих
					требованиям законодательства или соглашения.
				</p>
				<h4>3. Условия обработки персональной информации Пользователя и её передачи третьим лицам</h4>
				<p>
					<b>3.1.</b> ТПП обрабатывает персональную информацию Членов в соответствии с настоящей Политикой, условиями оказания конкретных сервисов и
					внутренними регламентами ТПП.
					<br />
					<b>3.2.</b> В отношении персональной информации Пользователя обеспечивается ее конфиденциальность.
					<br />
					<b>3.3.</b> ТПП вправе передать персональную информацию Пользователя третьим лицам в следующих случаях:
					<br />
					<b>3.3.1.</b> Пользователь выразил свое согласие на такие действия;
					<br />
					<b>3.3.2.</b> Передача необходима для использования определенного Сервиса ТПП или сервиса партнера ТПП, в том числе для исполнения
					распоряжения Пользователя. В частности, Персональная информация, может быть, переда третьим лицам следующих категорий:
					<br />
					<b>3.3.2.1.</b> Государственные организации и иные организации, участвующие при осуществлении обмена данных. Например, в целях соблюдения
					должного уровня безопасности обмена данных, совершаемых с использованием информационных систем, ТПП может передавать сведения, перечень
					которых устанавливается протоколами безопасности информационных систем, межведомственными системами. Передача сведений может носить
					обязательный характер, например, в части сведений о пользовательском оборудовании: IP-адрес, ОС, географические данные, ID/тип оборудования,
					используемый канал: браузер/ приложение, платежная авторизация, идентификация/ верификация или факультативный характер, например, в части
					сведений об индикаторах совпадения адресов, информации об аккаунте в системе поставщика, адресе электронной почты, номере мобильного
					телефона, об уровне риска, установленного поставщиком, информационной системы.
					<br />
					<b>3.3.2.2.</b> Партнеры по маркетингу и иные контрагенты ТПП.
					<br />
					<b>(а)</b>ТПП можем предоставить доступ к некоторым данным (например, статистике) для проведения маркетинговых и других исследований, а
					также к иным данным, позволяющим обеспечить передачу Пользователю рекламы, в том числе сторонних организаций, которая актуальна и может быть
					интересна Клиенту;
					<br />
					<b>(б)</b> ТПП может предоставить доступ к некоторым данным о платежных операциях Пользователя, являющихся основанием для определения
					партерном ТПП возможности предоставления такому Пользователю скидок (премий), поощрений вследствие выполнения Пользователем определенных
					условий, установленных партнером ТПП, а также о Бонусном счете Пользователя – участника Программы лояльности, когда такой доступ обусловлен
					возможностью предоставления Пользователю дополнительных условий использования Привилегий;
					<br />
					<b>(в)</b>ТПП может предоставить доступ к адресу электронной почты Пользователя, позволяющему партнеру ТПП обеспечить передачу фискального
					или иного документа, предусмотренного законодательством Республики Узбекистан;
					<br />
					<b>(г)</b>При использовании Пользователем сервисов и услуг, предоставляемых партнерами ТПП, информация о Пользователе может предоставляться
					таким лицам в объеме и в целях, необходимых для надлежащего предоставления сервисов Пользователю или повышающих уровень удобства их
					использования, например, для пред-заполнения регистрационных форм, обеспечивающего ускорение процесса прохождения процедуры регистрации в
					сервисах, предоставляемых партерами ТПП.
					<br />
					<b>3.3.2.3.</b> Партнеры, обеспечивающие хранение данных.
					<br />
					<b>3.3.2.4.</b> Партнеры, участвующие при обеспечении предотвращения условий, способствующих совершению с использованием сервисов ТПП
					действий, противоречащих требованиям законодательства или Политики.
				</p>
				<h4>3.3.2.5. Общедоступная информация.</h4>
				<p>
					Сервисы ТПП могут иметь форумы и/или чаты в любой социальной сети и канале, где Клиенты могут обмениваться идеями и общаться друг с другом.
					Публикуя сообщение на форуме или в чат-зоне, Пользователю следует иметь в виду, что такая информация будет общедоступна в режиме онлайн и
					такое размещение осуществляется Пользователем на его страх и риск.
					<br />
					<b>3.3.2.6.</b> Переход контроля. Передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к
					приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;
					<br />
					<b>3.3.2.7.</b> Передача предусмотрена законодательством Республики Узбекистан в рамках установленной законодательством процедуры;
					<br />
					<b>3.3.2.8.</b> В целях обеспечения возможности защиты прав и законных интересов ТПП или третьих лиц в случаях, когда у ТПП имеются
					достаточные основания полагать, что Пользователь нарушает условия применимой Политик с ТПП и/или требования применимого законодательства.
					<br />
					<b>3.3.2.9.</b> При использовании Пользователем сервисов и услуг Торгово-промышленной палаты Республики Узбекистан и/или его аффилированных
					лиц, персональная информация Пользователя может передаваться в Торгово-промышленной палаты Республики Узбекистан и /или его аффилированным
					лицам для обработки на условиях и для целей, определённых в настоящей Политике. Под персональной информацией Пользователя, применительно к
					настоящему пункту, понимаются в том числе данные об операциях с использованием Платежного сервиса ТПП, осуществленных с участием программных
					средств Торгово-промышленной палаты Республики Узбекистан.
					<br />
					<b>3.4.</b> При обработке персональных данных Членов ТПП руководствуется Законом РУз «О персональных данных» и другими нормативными актами,
					регулирующими отношения в сфере обеспечения безопасности персональных данных.
					<br />
					<b>3.5.</b> Раскрытие анонимных данных ТПП также может раскрывать партнерам анонимные данные (то есть данные, которые не раскрывают личность
					Пользователя ни прямо, ни косвенно), а также агрегированные данные (данные о группах и категориях Членов ). ТПП также можем разрешить
					партнерам собирать анонимные и агрегированные данные в рамках предоставления Пользователям возможности пользоваться отдельными функциями
					Сервисов, которые впоследствии могут передавать эти данные ТПП.
				</p>
				<h4>4. Изменение и удаление Пользователем персональной информации, а также получение доступа к ней.</h4>
				<p>
					<b>4.1.</b>
					В рамках Сервисов ТПП Пользователю предоставляться функциональная возможность изменить (обновить, дополнить) или удалить предоставленную
					Пользователем информацию или её часть. Отзыв Согласия на обработку персональных данных должен быть оформлен в письменном виде и направлен по
					электронной почте
					<b>info@chamber.uz.</b>
					<br />
					<b>4.1.1.</b> В пределах, установленных применимым законодательством, ТПП сообщает об изменении или уничтожении персональной информации
					каждому получателю, которому была раскрыта персональная информация, кроме случаев, когда это оказывается невозможным или требует
					несоразмерного усилия.
					<br />
					<b>4.2.</b> В соответствии с требованиями законодательства на ТПП может быть возложена обязанность осуществлять обработку / хранение
					полученной при использовании Сервисов ТПП персональной информации Пользователя. Такая обработка / хранение осуществляется ТПП в случаях, по
					основаниям и в течение сроков, установленных законодательством и настоящим Соглашением.
					<br />
					<b>4.4.</b> Списание средств происходит только в том случае, если депозит банковской карты, с которой производится списание, составляет
					сумму равную или превышающую размер платы за пользование Сервисом.
					<br />
				</p>
				<h4>4.3. Право на доступ</h4>
				<p>
					<b>4.3.1.</b> В соответствии с применимым законодательством, Пользователь имеет право на доступ к информации, полученной ТПП, то есть имеет
					право запросить информацию относительно:
					<br />
					<b>(а)</b>цели обработки;
					<br />
					<b>(б)</b> категории обрабатываемых данных;
					<br />
					<b>(в)</b> категорией получателей, которым были или будут переданы персональные данные Пользователя;
					<br />
					<b>(г) </b>срока хранения или критериев его определения, а также иных сведений.
					<br />
					<b>4.3.1.1.</b> Если иное не реализовано в интерфейсе Платежного сервиса ТПП, информация (копия) может предоставляться ТПП в письменной
					форме или при помощи иных средств связи.
					<br />
					<b>4.3.1.2.</b> Если ТПП имеет основания для сомнения относительно идентификации личности Пользователя, подающего запрос согласно п. 4.3.1
					настоящей Политики вправе затребовать предоставления дополнительной информации, необходимой для подтверждения личности такого Пользователя.
					<br />
					<b>4.3.1.3.</b> Рассмотрение запроса о предоставлении сведений (копии) осуществляется в течение одного месяца (30 дней) с момента его
					получения ТПП. ТПП вправе продлить указанный срок на два месяца (60 дней) с учетом сложности и количества запросов ТПП информирует
					Пользователя о таком продлении, любым удобным для ТПП способом, с указанием причин, послуживших основанием для такого продления.
					<br />
					<b>4.3.1.4.</b> В случае если запрос не имеет явного обоснования, а также в случае чрезмерного количества запросов, ТПП вправе взимать
					разумную плату за выполнение запроса (с учетом административных расходов) или отказаться от его выполнения. ТПП также не сможет предоставить
					Пользователю информацию о нем, опубликованную в порядке, предусмотренном в п. 3.3.2.5. Политики.
					<br />
					<b>4.3.1.5.</b> Пользователь вправе самостоятельно передать информацию, полученную от ТПП в порядке, предусмотренном в настоящем разделе
					другому контролеру.
				</p>
				<h4>4.4. Право на возражение</h4>
				<p>
					<b>4.4.1.</b> В пределах, установленных применимым законодательством, Пользователь может отозвать любое свое согласие, которое им было ранее
					предоставлено, или представить свои возражения на законных основаниях в отношении обработки его персональной информации. В некоторых
					ситуациях отзыв согласия будет означать, что Пользователь не сможет воспользоваться Сервисами ТПП.
					<br />
					<b>4.4.2.</b> В соответствии с применимым законодательством, Пользователь имеет право на подачу жалобы в надзорный орган.
				</p>
				<h4>5. Меры, применяемые для защиты персональной информации Клиентов.</h4>
				<p>
					<b>5.1.</b>
					ТПП принимает необходимые и достаточные организационные и технические меры для защиты персональной информации Пользователя от неправомерного
					или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней
					третьих лиц.
					<br />
					<b>5.2.</b> Защиту и обработку персональных данных Пользователя ТПП производит в соответствии с Законом РУз «О персональных данных» (ЗРУ-547
					от 02.07.2019 г.), и других нормативных актов, регулирующих отношения в сфере обеспечения безопасности персональных данных.
					<br />
					<b>5.3.</b> При обработке персональных данных ТПП обеспечивает их безопасность и принимает необходимые организационные и технические меры
					для защиты персональных данных от неправомерного или случайного доступа к ним, уничтожения, изменения, блокирования, копирования,
					распространения персональных данных, а также от иных неправомерных действий, путем установления в отношении таких данных режима
					конфиденциальности и контроля за его соблюдением, а также путем внедрения дополнительных мер защиты, реализующих требования законодательства
					Республики Узбекистан, стандартов и внутренних организационно-распорядительных документов ТПП.
					<br />
				</p>
				<h4>6. Изменение Политики конфиденциальности. Применимое законодательство</h4>
				<br />
				<b>6.1.</b> ТПП вправе предложить Пользователю изменить и/или дополнить настоящую Политику путем опубликования Соглашения в новой редакции.
				Принятием Пользователем такого предложения являются конклюдентные действия по использованию какого-либо из Сервисов ТПП на новых условиях.
				<br />
				<b>6.2.</b> К настоящей Политике и отношениям между Пользователем и ТПП, применяется законодательство Республики Узбекистан и нормативные
				акты, регулирующие отношения в сфере обеспечения безопасности персональных данных.
				<br />
				<br />
				<h4>7. Взаимодействие с Пользователями по вопросам обработки персональной Информации</h4>
				<p>
					<b>7.1.</b> Вопросы или замечания в отношении настоящего Соглашения могут быть направлены на электронный адрес: info@chamber.uz.
					<br />
					<b>7.2.</b> ТПП вправе не отвечать на вопросы, не имеющие отношения к положениям настоящей Политики, что не лишает Пользователя возможности
					направить такие вопросы ТПП по адресам, в разделе <b>«Контактная информация ИП ООО Торгово-промышленной палаты Республики Узбекистан.</b>
					<br />
				</p>
			</section>
		</section>
	</main>
</template>

<style lang="scss" scoped>
html,
body {
	font-family: sans-serif;
	font-size: 16px;
    background: #fff;
}
:-webkit-any(article, aside, nav, section) h1 {
	font-size: 1.5em;
	margin-block-start: 0.83em;
	margin-block-end: 0.83em;
}
h1 {
	display: block;
	font-size: 2em;
	margin-block-start: 0.67em;
	margin-block-end: 0.67em;
	margin-inline-start: 0px;
	margin-inline-end: 0px;
	font-weight: bold;
}
h1 {
	text-align: center;
	margin: 0;
}
p {
	color: #000;
	display: block;
	margin-block-start: 1em;
	margin-block-end: 1em;
	margin-inline-start: 0px;
	margin-inline-end: 0px;
}
h4 {
	text-align: center;
	margin: 0;
	display: block;
	margin-block-start: 1.33em;
	margin-block-end: 1.33em;
	margin-inline-start: 0px;
	margin-inline-end: 0px;
	font-weight: bold;
}
</style>
